## Titanic Kaggle Competition
#### Team Mustang Manic Miners:  Chad, Jainy and Rahn

This notebook is our Python exploration of the titanic dataset.

## 1 - Purpose
The Titanic competition explores the dataset of titanic passengers and who survived.  By studying this, we want to make a predictive model to determine who survives the sinking of the ship.

In [1]:
# Setup
import pandas as pd
import numpy as np
import sklearn as sk

train = pd.read_csv("data/train.csv")
# test = pd.read_csv("data/test.csv")

Description of data (as given in the competition site):
-  __Pclass__ is the Ticket-class: first (1), second (2), and third (3) class tickets were used. This is an ordinal integer feature.

-  __Name__ is the name of the passenger. The names also contain titles and some persons might share the same surname; indicating family relations. We know that some titles can indicate a certain age group. For instance Master is a boy while Mr is a man. This feature is a character string of variable length but similar format.

-  __Sex__ is an indicator whether the passenger was female or male. This is a categorical text string feature.

-  __Age__ is the integer age of the passenger. There are NaN values in this column.

-  __SibSp__ is another ordinal integer feature describing the number of siblings or spouses travelling with each passenger.

-  __Parch__ is another ordinal integer features that gives the number of parents or children travelling with each passenger.

-  __Ticket__ is a character string of variable length that gives the ticket number.

-  __Fare__ is a float feature showing how much each passenger paid for their rather memorable journey.

-  __Cabin__ gives the cabin number of each passenger. There are NaN in this column. This is another string feature.

-  __Embarked__ shows the port of embarkation as a categorical character value.

In [3]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [5]:
print(train.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

 This shows we are missing the age of 177 passengers, and the cabin for 687 of them.
 Now, lets look at the survival rate for our training data.

In [25]:
survived = train[train['Survived']== 1]  # create an array of all rows where survived=1
not_survived = train[train['Survived']== 0]
total = len(train)

print "Survived: %i (%.1f percent)" %(len(survived), 1.*len(survived)/total * 100)
print "Not Survived: %i (%.1f percent)" %(len(not_survived), 1.*len(not_survived)/total * 100)
print "Total: %i"% total

Survived: 342 (38.4 percent)
Not Survived: 549 (61.6 percent)
Total: 891

## References
-  Pytanic project notebook. This is another teams kernal used as a reference, https://www.kaggle.com/headsortails/pytanic